#!/bin/bash

if [ -z "$1" ]; then # -z — проверяет, пустая ли строка, $1 — доступ к аргументам, переданным скрипту.
    echo "Не указано первое число" # вывод текста в консоль.
    exit 1
fi

if [ -z "$2" ]; then
    echo "Не указан оператор (+, -, *, /)"
    exit 1
fi

if [ -z "$3" ]; then
    echo "Не указано второе число"
    exit 1
fi

if [ "$2" == "+" ]; then
    result=$(($1 + $3))
elif [ "$2" == "-" ]; then
    result=$(($1 - $3))
elif [ "$2" == "ymn" ]; then
    result=$(($1 * $3))
elif [ "$2" == "/" ]; then
    result=$(($1 / $3))
else
    echo "Указан не верный оператор, необходимо указать на выбор +, -, *, /"
fi

echo "$result"